In [1]:
import pandas as pd
import numpy as np

# Hierarchical Indexing

### Multiindex

If you set an index to more than one columnn you are creating multi index or Hieararchical index. This makes asking questions based on indexes a lot more easier, and also opens the possibility of working with multidimensional data. 

We'll use the example sourced from [here](https://chrisalbon.com/python/pandas_hierarchical_data.html).

In [2]:
# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

## Setting an index of an existing `DataFrame`

In [3]:
df_1_ind = df.set_index('regiment')
df_1_ind

           company      name  preTestScore  postTestScore
regiment
Nighthawks     1st    Miller             4             25
Nighthawks     1st  Jacobson            24             94
Nighthawks     2nd       Ali            31             57
Nighthawks     2nd    Milner             2             62
Dragoons       1st     Cooze             3             70
Dragoons       1st     Jacon             4             25
Dragoons       2nd    Ryaner            24             94
Dragoons       2nd      Sone            31             57
Scouts         1st     Sloan             2             62
Scouts         1st     Piger             3             70
Scouts         2nd     Riani             2             62
Scouts         2nd       Ali             3             70

In [4]:
df_1_ind.mean(level = 'regiment')

            preTestScore  postTestScore
regiment
Nighthawks         15.25           59.5
Dragoons           15.50           61.5
Scouts              2.50           66.0

In [5]:
# Set the hierarchical index to be by regiment, and then by company
df_2_ind = df.set_index(['regiment', 'company'])
df_2_ind

                        name  preTestScore  postTestScore
regiment   company
Nighthawks 1st        Miller             4             25
           1st      Jacobson            24             94
           2nd           Ali            31             57
           2nd        Milner             2             62
Dragoons   1st         Cooze             3             70
           1st         Jacon             4             25
           2nd        Ryaner            24             94
           2nd          Sone            31             57
Scouts     1st         Sloan             2             62
           1st         Piger             3             70
           2nd         Riani             2             62
           2nd           Ali             3             70

<div class="alert alert-block alert-info">
<p>
Having multiple indexes will give you an easy way to model more than two dimensional data with DataFrames. Remember DataFraemes are by default a two dimensional data structures. 
</p>
<p>
For the above example, you can imagine each regiment is a two-dimensional array giving details about the company, names and the scores, and they are stacked one below the other. 
</p>
</div>

* How about you want to get the mean scores, based on the company but not the regiment?

In [6]:
df_2_ind.mean(level='company')

         preTestScore  postTestScore
company
1st          6.666667      57.666667
2nd         15.500000      67.000000

In [7]:
df_2_ind.mean(level='regiment')

            preTestScore  postTestScore
regiment
Nighthawks         15.25           59.5
Dragoons           15.50           61.5
Scouts              2.50           66.0

In [8]:
df_2_ind.mean(level=['regiment','company'])

                    preTestScore  postTestScore
regiment   company
Nighthawks 1st              14.0           59.5
           2nd              16.5           59.5
Dragoons   1st               3.5           47.5
           2nd              27.5           75.5
Scouts     1st               2.5           66.0
           2nd               2.5           66.0

# Pandas Aggregation

We have already seen some simple aggregations on Pandas **`Series`** and **`DataFrame`** objects.

Let us review a few aggregation functions that will help us in understanding the **Grouping**.

In [9]:
# We'll be using our college scorecard dataset in this tutorial.
college_scorecard = pd.read_csv('./data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1')

<div class="alert alert-block alert-info">
<p>
Remember, that a series actually holds its values in a nested NumPy array (ndarray) object. Pandas simply has to apply these aggregations functions to that nested array.
</p>
</div>

Here is the list of available `Series` and `DataFrame` aggregation methods from your textbook.

| Aggregation Function      | Description    |      
|---------------|---------------------|
|count()        |Total number of items (not including NaN)|
|first(), last()|First and last item  |
|mean(), median()  |Mean and median   |
|min(), max()   |Minimum and Maximum  |
|std(), var()   |Standard deviation & variance |
|mad()          |Mean absolute deviation |
|prod()         |Product of all items         |
|sum()          |Sum of all items           |

### The `describe()` method
The `describe()` method is available on both **`Series`** and **`DataFrame`** objects and outputs a variety of aggregations that are very useful in getting the general "sense" of a dataset.

Take a look at the output for our **`sat_average`** series and **`college_scorecard`** dataframe.

In [10]:
sat_averages = college_scorecard['sat_average']

In [11]:
sat_averages.describe()

count    1304.000000
mean     1059.072086
std       133.356979
min       720.000000
25%       973.000000
50%      1039.500000
75%      1120.250000
max      1545.000000
Name: sat_average, dtype: float64

In [12]:
college_scorecard.describe()

,UNITID,OPEID,OPEID6,predominant_degree_code,institutional_owner_code,locale,men_only,women_only,religious_affiliation_code,sat_reading_25,...,part_time_students_percentage,open_or_closed,average_net_price_public,average_net_price_private,pell_grant_receipents,full_time_retention_rate_4_year,full_time_retention_rate_less_than_4_year,part_time_rentention_rate_4_year,part_time_rentention_rate_less_than_4_year,students_with_federal_loans
count,7282.000000,7.282000e+03,7282.000000,7282.000000,7282.000000,7282.000000,7282.000000,7282.000000,7109.000000,1195.000000,...,6969.000000,7282.000000,1911.000000,4688.000000,6966.000000,2293.000000,3843.000000,1412.000000,2208.000000,6966.000000
mean,283704.088300,1.911246e+06,16393.400439,1.903735,2.196924,19.620434,0.009063,0.005356,5.256576,468.421757,...,0.225924,0.901126,9624.656201,18230.176621,0.532093,0.707081,0.686155,0.455639,0.564679,0.523092
std,133558.728309,3.459461e+06,13945.231754,0.954501,0.838866,9.366024,0.094776,0.072991,20.379158,69.283492,...,0.246391,0.298513,4669.671522,7272.125743,0.225941,0.195645,0.180121,0.293325,0.263540,0.284088
min,100654.000000,1.002000e+05,1002.000000,0.000000,1.000000,-3.000000,0.000000,0.000000,-2.000000,265.000000,...,0.000000,0.000000,-2434.000000,-581.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,170749.500000,3.459500e+05,3459.500000,1.000000,1.000000,12.000000,0.000000,0.000000,-2.000000,420.000000,...,0.000000,1.000000,6297.000000,13314.500000,0.358850,0.618200,0.567900,0.250000,0.382925,0.333300
50%,222372.500000,1.063250e+06,10490.000000,2.000000,2.000000,21.000000,0.000000,0.000000,-2.000000,458.000000,...,0.148900,1.000000,8751.000000,18254.500000,0.523300,0.741400,0.690600,0.450000,0.503250,0.584900
75%,442070.750000,3.010606e+06,26089.750000,3.000000,3.000000,22.000000,0.000000,0.000000,-2.000000,500.000000,...,0.376600,1.000000,12704.000000,22719.500000,0.714300,0.833300,0.815750,0.636400,0.789500,0.747325
max,485458.000000,8.209882e+07,42371.000000,4.000000,3.000000,43.000000,1.000000,1.000000,105.000000,730.000000,...,1.000000,1.000000,28201.000000,89406.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

#### Tweaking `describe()` behavior with `include` and `exclude` parameters.
When used on a **`DataFrame`** object, the default behavior of the **`describe()`** method is to provide statistics on numeric columns only.

Let's take a look at the **`dtypes`** attribute on our college_scorecard dataframe to see what columns this does/doesn't include.

In [13]:
college_scorecard.dtypes

UNITID                                       int64
OPEID                                        int64
OPEID6                                       int64
institution_name                            object
city                                        object
                                            ...
students_with_federal_loans                float64
median_student_earnings                     object
median_student_debt                         object
less_than_4_year_school_completion_rate     object
4_year_school_completion_rate               object
Length: 63, dtype: object

<div class="alert alert-block alert-info">
<p>
The `dtype` attribute of `DataFrame` objects returns information on the datatype of each nested series/column.
</p>
</div>

See all the places where it lists the datatype of a column as 'object'? These columns won't be reported on with **`describe()`** when using the default parameters.

We can change this using either the **`include`** or the **`exclude`** parameters:

In [14]:
# Include the object datatype columns
college_scorecard.describe(include= [np.object])

<ipython-input-14-0350e80673ea>:2: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  college_scorecard.describe(include= [np.object])

,institution_name,city,state,url,predominant_degree_desc,institutional_owner_desc,religious_affiliation_desc,median_student_earnings,median_student_debt,less_than_4_year_school_completion_rate,4_year_school_completion_rate
count,7282,7282,7282,7225,7282,7282,7282,6201,7251,3972,2497
unique,7164,2493,59,5992,5,3,61,598,2059,3742,2377
top,Stevens-Henager College,New York,CA,www.itt-tech.edu,Certificate,PrivateForProfit,Not applicable,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed
freq,7,87,708,143,3343,3420,6199,816,1519,166,116

In [15]:
# Exclude the numeric datatypes
college_scorecard.describe(exclude=[np.number])

,institution_name,city,state,url,predominant_degree_desc,institutional_owner_desc,religious_affiliation_desc,median_student_earnings,median_student_debt,less_than_4_year_school_completion_rate,4_year_school_completion_rate
count,7282,7282,7282,7225,7282,7282,7282,6201,7251,3972,2497
unique,7164,2493,59,5992,5,3,61,598,2059,3742,2377
top,Stevens-Henager College,New York,CA,www.itt-tech.edu,Certificate,PrivateForProfit,Not applicable,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed
freq,7,87,708,143,3343,3420,6199,816,1519,166,116

There are two things here to notice:
1. The type of statistics returned changed when operating on **`object`** column types.
2. I used NumPy datatypes in the specification of what to include and exclude.

**The Statistics**  
Object(esp. string based) columns cannot be summarized reasonably with many of numeric aggregations so Pandas gives an alternative set of aggregations which make more sense for this type of data.

**NumPy Datatypes**  
Remember that the values of each `Series` inside of a `DataFrame` are stored in a NumPy array. Therefore the elements in that NumPy array are described by NumPy datatypes.

That is why we specify NumPy datatypes here to specifically include/exclude them for Pandas `describe` method.

This is just another example of the tight integration between the two libraries.

In [16]:
# Finally, you can specify **`include='all'`** to force Pandas
# to evaluate all columns.  It will inject NaN where
# a calculation cannot be done.
college_scorecard.describe(include='all')

,UNITID,OPEID,OPEID6,institution_name,city,state,url,predominant_degree_code,predominant_degree_desc,institutional_owner_code,...,pell_grant_receipents,full_time_retention_rate_4_year,full_time_retention_rate_less_than_4_year,part_time_rentention_rate_4_year,part_time_rentention_rate_less_than_4_year,students_with_federal_loans,median_student_earnings,median_student_debt,less_than_4_year_school_completion_rate,4_year_school_completion_rate
count,7282.000000,7.282000e+03,7282.000000,7282,7282,7282,7225,7282.000000,7282,7282.000000,...,6966.000000,2293.000000,3843.000000,1412.000000,2208.000000,6966.000000,6201,7251,3972,2497
unique,NaN,NaN,NaN,7164,2493,59,5992,NaN,5,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,598,2059,3742,2377
top,NaN,NaN,NaN,Stevens-Henager College,New York,CA,www.itt-tech.edu,NaN,Certificate,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed
freq,NaN,NaN,NaN,7,87,708,143,NaN,3343,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,816,1519,166,116
mean,283704.088300,1.911246e+06,16393.400439,NaN,NaN,NaN,NaN,1.903735,NaN,2.196924,...,0.532093,0.707081,0.686155,0.455639,0.564679,0.523092,NaN,NaN,NaN,NaN
std,133558.728309,3.459461e+06,13945.231754,NaN,NaN,NaN,NaN,0.954501,NaN,0.838866,...,0.225941,0.195645,0.180121,0.293325,0.263540,0.284088,NaN,NaN,NaN,NaN
min,100654.000000,1.002000e+05,1002.000000,NaN,NaN,NaN,NaN,0.000000,NaN,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN
25%,170749.500000,3.459500e+05,3459.500000,NaN,NaN,NaN,NaN,1.000000,NaN,1.000000,...,0.358850,0.618200,0.567900,0.250000,0.382925,0.333300,NaN,NaN,NaN,NaN
50%,222372.500000,1.063250e+06,10490.000000,NaN,NaN,NaN,NaN,2.000000,NaN,2.000000,...,0.523300,0.741400,0.690600,0.450000,0.503250,0.584900,NaN,NaN,NaN,NaN
75%,442070.750000,3.010606e+06,26089.750000,NaN,NaN,NaN,NaN,3.000000,NaN,3.000000,...,0.714300,0.833300,0.815750,0.636400,0.789500,0.747325,NaN,NaN,NaN,NaN
max,485458.000000,8.209882e+07,42371.000000,NaN,NaN,NaN,NaN,4.000000,NaN,3.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,NaN,NaN,NaN,NaN

# Pandas Grouping

In this case we will look at the sample dataset of the flight schedules data that is available on Kaggle [here](https://www.kaggle.com/usdot/flight-delays)

This is only a sample of the original data. You will use the original data in your Group Project!

In [17]:
flights = pd.read_csv('./data/flight_sample.csv')
flights.head()

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
0,2015,8,19,3,EV,3260,7.0,20.0,1091
1,2015,9,23,3,WN,3050,4.0,9.0,837
2,2015,10,16,5,AA,1382,13.0,25.0,761
3,2015,1,19,1,WN,4274,5.0,23.0,1547
4,2015,4,22,3,WN,2237,5.0,18.0,872

## The `groupby()` Method

So far, all the calculations that we've done on **`DataFrame`** objects have looked at the values of columns as a whole.

The `groupby()` method allows you to move into deeper forms analysis by splitting up the rows of a dataset into groups by the values in specified row(s). You can think of this in some ways as putting rows into buckets for evaluation.

### Specifying how to Split your Dataset into Groups
Of course, before we can perform evaluations on groups, we have to create them from an existing dataframe. 

Let's explore how **`groupby()`** provides a variety of ways to split up your datasets. We'll explore some of these here, starting with the most simple.

#### Single Column Grouping

In [18]:
# NOTE THIS IS ONLY SHOWING GROUPS, LOOK BELOW ON HOW TO USE THE GROUPS
flights_by_airline = flights.groupby(['AIRLINE'])
flights_by_airline.groups

{'AA': [2, 19, 43, 55, 59, 64, 71, 74, 82, 92, 100, 134, 139, 141, 156, 160, 171, 179, 182, 186, 215, 222, 254, 268, 289, 295, 298, 307, 310, 351, 352, 361, 362, 363, 376, 384, 387, 401, 414, 417, 426, 433, 443, 445, 458, 475, 476, 497, 502, 505, 511, 512, 518, 542, 545, 570, 571, 573, 574, 581, 583, 593, 594, 612, 616, 618, 635, 641, 644, 655, 662, 683, 701, 705, 715, 722, 727, 736, 751, 767, 777, 779, 782, 791, 795, 820, 821, 825, 826, 836, 847, 848, 856, 860, 867, 873, 880, 882, 889, 892, ...], 'AS': [18, 26, 27, 79, 95, 127, 147, 167, 180, 181, 207, 313, 333, 343, 377, 383, 470, 535, 547, 560, 598, 636, 679, 741, 744, 749, 774, 792, 845, 853, 893, 938, 1043, 1074, 1105, 1137, 1171, 1172, 1187, 1245, 1272, 1313, 1324, 1345, 1346, 1377, 1437, 1500, 1526, 1528, 1543, 1571, 1598, 1599, 1646, 1722, 1783, 1785, 1800, 1801, 1821, 1902, 1904, 1943, 1984, 2023, 2139, 2212, 2216, 2219, 2259, 2332, 2393, 2418, 2461, 2468, 2511, 2554, 2676, 2748, 2814, 2821, 2849, 2854, 2884, 2964, 3006, 3050, 3059, 3120, 3203, 3291, 3292, 3308, 3321, 3322, 3379, 3398, 3417, 3431, ...], 'B6': [20, 23, 44, 51, 61, 87, 111, 144, 151, 170, 173, 185, 189, 209, 213, 217, 231, 263, 265, 296, 341, 344, 365, 368, 370, 385, 393, 428, 452, 500, 530, 551, 576, 585, 647, 675, 682, 699, 747, 829, 840, 841, 843, 913, 930, 976, 984, 986, 1039, 1061, 1089, 1112, 1132, 1139, 1166, 1177, 1193, 1199, 1202, 1208, 1232, 1237, 1239, 1254, 1297, 1351, 1361, 1440, 1462, 1480, 1482, 1501, 1558, 1567, 1583, 1633, 1667, 1692, 1711, 1799, 1819, 1835, 1847, 1850, 1871, 1905, 1915, 1918, 1923, 1964, 2007, 2059, 2061, 2073, 2101, 2103, 2104, 2110, 2129, 2137, ...], 'DL': [14, 22, 33, 39, 40, 47, 67, 72, 77, 80, 85, 90, 91, 99, 113, 119, 123, 137, 138, 145, 148, 153, 154, 158, 159, 165, 172, 192, 206, 220, 228, 232, 233, 244, 248, 253, 256, 258, 274, 277, 286, 292, 312, 316, 322, 323, 336, 360, 374, 378, 381, 382, 386, 389, 391, 394, 402, 410, 412, 413, 415, 416, 435, 438, 444, 446, 471, 480, 481, 491, 496, 508, 514, 519, 522, 525, 536, 538, 539, 540, 548, 558, 559, 561, 584, 590, 591, 601, 615, 619, 624, 643, 656, 661, 672, 674, 689, 697, 700, 703, ...], 'EV': [0, 5, 12, 13, 42, 57, 65, 69, 88, 94, 96, 102, 103, 104, 106, 109, 116, 129, 143, 190, 193, 202, 208, 273, 276, 278, 290, 317, 324, 325, 326, 349, 359, 369, 380, 392, 397, 398, 405, 423, 424, 431, 436, 437, 441, 447, 468, 472, 474, 478, 493, 516, 523, 532, 533, 543, 544, 546, 554, 556, 557, 563, 582, 609, 633, 652, 665, 684, 686, 695, 698, 706, 721, 729, 740, 745, 755, 759, 762, 776, 785, 800, 807, 812, 828, 837, 859, 898, 899, 904, 905, 911, 928, 977, 1000, 1005, 1014, 1024, 1035, 1037, ...], 'F9': [41, 52, 133, 150, 161, 184, 311, 338, 555, 600, 603, 631, 669, 685, 710, 732, 735, 842, 917, 1044, 1083, 1122, 1242, 1335, 1337, 1415, 1492, 1588, 1718, 1740, 1741, 1950, 1962, 2009, 2046, 2085, 2091, 2096, 2181, 2248, 2362, 2541, 2550, 2598, 2707, 2734, 2790, 2910, 2934, 3033, 3092, 3103, 3166, 3260, 3534, 3548, 3552, 3716, 3725, 3896, 3942, 3998, 4036, 4237, 4603, 4629, 4773, 4775, 4987, 5018, 5067, 5094, 5266, 5348, 5538, 5775, 5858, 5929, 5978, 6035, 6047, 6115, 6121, 6134, 6176, 6330, 6404, 6428, 6504, 6793, 6889, 6893, 6912, 6955, 6977, 7014, 7071, 7274, 7331, 7332, ...], 'HA': [6, 31, 68, 131, 210, 259, 339, 346, 403, 489, 681, 696, 1032, 1054, 1097, 1225, 1302, 1708, 1771, 1794, 1907, 1909, 1927, 1986, 2318, 2364, 2396, 2416, 2482, 2518, 2532, 2617, 2629, 2806, 2961, 3030, 3250, 3409, 3632, 3650, 3878, 3950, 4173, 4246, 4305, 4426, 4439, 4737, 4768, 4769, 4958, 5166, 5190, 5216, 5224, 5301, 5377, 5409, 5506, 5545, 5577, 5637, 5641, 5781, 5819, 5825, 5836, 5958, 6005, 6037, 6220, 6356, 6402, 6418, 6569, 6607, 6612, 6686, 6731, 6762, 6783, 6909, 7042, 7123, 7287, 7342, 7435, 7679, 7750, 7773, 7812, 7814, 7924, 7984, 8028, 8078, 8097, 8148, 8256, 8292, ...], 'MQ': [11, 62, 84, 108, 110, 121, 155, 178, 225, 247, 249, 257, 309, 356, 357, 427, 469, 477, 488, 503, 529, 567, 621, 628, 654, 663, 688, 743, 752, 778, 793, 804, 810, 875, 877, 883, 924, 925, 927, 931, 933, 945, 947, 966, 985, 1002, 1007, 1011, 1023, 1026, 1058, 1062, 1077, 1101, 1117, 1145, 1155, 1170, 1205, 1214, 1223, 1261, 1271, 1314, 1326, 1330, 1397, 1409, 1439, 1442, 1455, 1476, 1514, 1520, 1530, 1546, 1562, 1578, 1592, 1611, 1615, 1643, 1723, 1753, 1770, 1778, 1798, 1827, 1852, 1872, 1876, 1908, 1953, 1956, 2058, 2092, 2102, 2113, 2125, 2135, ...], 'NK': [227, 241, 299, 329, 331, 334, 396, 442, 483, 495, 504, 520, 632, 758, 835, 846, 878, 906, 987, 997, 999, 1275, 1309, 1329, 1380, 1524, 1541, 1624, 1631, 1659, 1709, 1784, 1792, 1884, 2002, 2029, 2055, 2064, 2069, 2076, 2170, 2201, 2242, 2298, 2305, 2348, 2349, 2371, 2452, 2506, 2543, 2580, 2700, 2706, 2870, 2894, 2970, 2972, 3001, 3054, 3069, 3124, 3199, 3281, 3299, 3343, 3436, 3458, 3588, 3714, 3723, 3852, 3972, 4056, 4065, 4068, 4079, 4114, 4143, 4184, 4315, 4395, 4481, 4482, 4500, 4558, 4576, 4579, 4580, 4602, 4672, 4822, 4846, 4885, 4937, 4942, 4975, 5005, 5124, 5186, ...], 'OO': [15, 24, 28, 37, 75, 83, 93, 101, 114, 115, 117, 124, 126, 128, 142, 183, 197, 199, 214, 219, 223, 224, 230, 252, 255, 264, 272, 284, 285, 287, 304, 318, 320, 330, 340, 342, 350, 353, 354, 355, 366, 373, 406, 407, 409, 420, 429, 432, 456, 459, 490, 498, 515, 537, 549, 550, 564, 568, 572, 575, 586, 588, 595, 597, 599, 608, 620, 622, 649, 657, 690, 726, 728, 739, 754, 763, 768, 796, 801, 802, 816, 818, 823, 839, 857, 874, 884, 885, 886, 887, 915, 921, 926, 932, 935, 937, 946, 962, 968, 979, ...], 'UA': [10, 17, 21, 34, 35, 48, 49, 50, 53, 56, 66, 76, 81, 89, 136, 157, 162, 169, 174, 175, 176, 177, 201, 216, 229, 236, 238, 239, 245, 251, 262, 266, 267, 271, 275, 300, 301, 302, 305, 315, 375, 395, 404, 434, 450, 454, 461, 462, 463, 473, 492, 499, 528, 534, 541, 580, 589, 592, 604, 610, 630, 634, 659, 660, 670, 677, 692, 694, 711, 760, 769, 770, 772, 787, 815, 819, 824, 831, 833, 852, 870, 871, 890, 895, 903, 934, 941, 974, 975, 983, 988, 995, 1016, 1029, 1030, 1041, 1046, 1055, 1069, 1073, ...], 'US': [8, 16, 60, 118, 194, 288, 367, 464, 467, 494, 531, 605, 611, 614, 627, 640, 666, 678, 680, 693, 765, 822, 830, 864, 866, 891, 908, 951, 967, 1066, 1096, 1125, 1164, 1228, 1270, 1334, 1344, 1381, 1404, 1417, 1418, 1421, 1452, 1460, 1469, 1493, 1529, 1545, 1560, 1575, 1577, 1603, 1636, 1656, 1680, 1688, 1748, 1767, 1786, 1790, 1851, 1899, 1917, 1991, 2005, 2037, 2108, 2131, 2171, 2184, 2218, 2249, 2277, 2280, 2293, 2429, 2464, 2533, 2542, 2559, 2560, 2576, 2597, 2612, 2691, 2713, 2742, 2852, 2863, 2865, 2937, 3028, 3249, 3314, 3355, 3363, 3425, 3429, 3448, 3470, ...], 'VX': [29, 70, 135, 191, 270, 399, 521, 602, 712, 761, 771, 794, 809, 1131, 1146, 1320, 1363, 1527, 1552, 1585, 1926, 2258, 2640, 2711, 2715, 2805, 2931, 2957, 3089, 3157, 3174, 3194, 3238, 3256, 3526, 3530, 3533, 3888, 3901, 4027, 4041, 4101, 4156, 4332, 4472, 4617, 4679, 4702, 4755, 5022, 5046, 5101, 5195, 5281, 5349, 5371, 5385, 5400, 5421, 5526, 5565, 5896, 6126, 6398, 6423, 6527, 6567, 6580, 6594, 6652, 6660, 6822, 7219, 7248, 7276, 7295, 7302, 7304, 7501, 7613, 7712, 7831, 7842, 7993, 8008, 8079, 8117, 8188, 8241, 8267, 8304, 8415, 8512, 8724, 8776, 8867, 8985, 9048, 9164, 9217, ...], 'WN': [1, 3, 4, 7, 9, 25, 30, 32, 36, 38, 45, 46, 54, 58, 63, 73, 78, 86, 97, 98, 105, 107, 112, 120, 122, 125, 130, 132, 140, 146, 149, 152, 163, 164, 166, 168, 187, 188, 195, 196, 198, 200, 203, 204, 205, 211, 212, 218, 221, 226, 234, 235, 237, 240, 242, 243, 246, 250, 260, 261, 269, 279, 280, 281, 282, 283, 291, 293, 294, 297, 303, 306, 308, 314, 319, 321, 327, 328, 332, 335, 337, 345, 347, 348, 358, 364, 371, 372, 379, 388, 390, 400, 408, 411, 418, 419, 421, 422, 425, 430, ...]}

The **`groupby()`** method returns an type called **`DataFrameGroupBy`**. We will explore it in more depth shortly, but for now just know that it has an attribute called **`groups`** which provides a *`dict`* object with the **labels** of each group and the **corresponding index values** in the original dataframe that belong to that group.

If you look above, you can see there is a group labelled 'AA' will index values [2,   19,   43,   55,   59,   64,   71,   74,   82,   92, ...].

You can think of this as a record of all the groups that we will perform calculations on later.

#### Multi Column Grouping

You can specify multiple columns if you wish to split your data up in multiple levels:

In [19]:
# NOTE THIS IS ONLY SHOWING GROUPS, LOOK BELOW ON HOW TO USE THE GROUPS
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])
flights_by_airline_month.groups

{('AA', 1): [182, 476, 573, 641, 655, 722, 848, 914, 971, 1027, 1266, 1836, 1889, 1892, 2024, 2060, 2062, 2188, 2207, 2240, 2409, 2454, 2512, 2652, 2737, 2895, 2933, 2958, 2978, 3039, 3542, 3562, 3635, 3808, 4031, 4130, 4193, 4245, 4318, 4435, 4540, 4623, 4631, 4800, 4914, 4955, 5199, 5239, 5402, 5417, 5453, 5773, 5853, 5870, 5893, 5963, 6028, 6149, 6345, 6395, 6736, 6800, 6997, 7051, 7229, 7239, 7380, 7434, 7717, 7791, 7862, 7875, 7879, 8015, 8205, 8217, 8233, 8243, 8280, 8329, 8497, 8742, 8779, 8872, 9152, 9236, 9294, 9571], ('AA', 2): [512, 571, 616, 727, 860, 929, 953, 956, 1086, 1118, 1159, 1231, 1291, 1456, 1512, 1734, 1796, 1910, 1940, 1941, 1959, 2090, 2430, 2589, 2962, 3257, 3358, 3369, 3629, 3760, 3851, 4019, 4060, 4078, 4155, 4319, 4508, 4520, 4575, 4829, 5759, 5924, 6170, 6215, 6350, 6488, 6645, 6684, 6817, 7392, 7414, 7673, 7683, 7686, 7868, 7927, 7996, 8102, 8135, 8164, 8209, 8398, 8719, 8751, 8970, 9073, 9178, 9336, 9378, 9460, 9647, 9715, 9787, 9794], ('AA', 3): [19, 384, 401, 581, 777, 821, 959, 1366, 1367, 1669, 1780, 1806, 1812, 1840, 1925, 1932, 2011, 2013, 2177, 2241, 2440, 2483, 2579, 2893, 2947, 2969, 3047, 3128, 3324, 3600, 3653, 3730, 3869, 4076, 4121, 4267, 4359, 4408, 4556, 5135, 5232, 5286, 5315, 5427, 5525, 5610, 5615, 5725, 5844, 6269, 6483, 6558, 6682, 6690, 6926, 7057, 7230, 7258, 7265, 7282, 7308, 7364, 7488, 7519, 7697, 7802, 7848, 7998, 8050, 8127, 8161, 8208, 8556, 8628, 8824, 8848, 8852, 8922, 8926, 8977, 9173, 9284, 9327, 9545, 9587, 9767, 9791, 9871, 9893], ('AA', 4): [92, 186, 268, 289, 351, 545, 574, 593, 618, 705, 1070, 1221, 1257, 1294, 1327, 1689, 1750, 2118, 2166, 2202, 2338, 2392, 2408, 2447, 2799, 3155, 3261, 3284, 3509, 3512, 3744, 3757, 3818, 3900, 3948, 3968, 4327, 4349, 4369, 4389, 4497, 4531, 4591, 4990, 5000, 5422, 5511, 5635, 5680, 5757, 6158, 6335, 6453, 6667, 6759, 6813, 6820, 7047, 7098, 7149, 7397, 7444, 7446, 7467, 7551, 7599, 8038, 8110, 8143, 8179, 8515, 8559, 8893, 8966, 9014, 9103, 9304, 9472, 9646, 9660, 9668, 9731, 9734, 9816, 9902, 9932, 9943], ('AA', 5): [179, 295, 387, 542, 847, 856, 889, 1127, 1165, 1190, 1349, 1601, 1685, 1811, 1863, 2034, 2555, 2669, 3046, 3093, 3119, 3144, 3190, 3198, 3318, 3378, 3593, 3612, 3672, 3684, 3889, 3915, 4010, 4177, 4394, 4411, 4483, 4525, 4596, 4636, 4676, 4718, 4792, 4808, 4849, 5040, 5209, 5217, 5311, 5361, 5389, 5436, 5647, 5833, 5969, 6066, 6181, 6229, 6578, 6766, 6857, 6883, 6915, 6928, 7156, 7472, 7772, 7826, 7896, 8298, 8408, 8763, 8829, 8856, 8928, 9434, 9519, 9610, 9809, 9953], ('AA', 6): [43, 254, 363, 497, 767, 1006, 1121, 1280, 1388, 1674, 1696, 1772, 1833, 1887, 2079, 2150, 2276, 2326, 2339, 2488, 2572, 2635, 2856, 2890, 2900, 3317, 3575, 3779, 3953, 4089, 4215, 4352, 4841, 4918, 5095, 5713, 5737, 5916, 6146, 6196, 6339, 6444, 6749, 7161, 7279, 7571, 7584, 7676, 7736, 7894, 8194, 8235, 8268, 8420, 8461, 8547, 8791, 8883, 9122, 9184, 9483, 9643], ('AA', 7): [100, 156, 310, 352, 426, 475, 644, 662, 825, 940, 991, 1080, 1233, 1268, 1319, 1333, 1340, 1475, 1535, 1654, 1695, 1873, 1886, 1895, 2205, 2387, 2444, 2568, 2684, 2710, 2720, 2739, 2810, 2867, 2942, 3026, 3063, 3066, 3239, 3271, 3384, 3481, 3495, 3502, 3521, 3528, 3736, 3848, 3920, 3930, 4082, 4157, 4174, 4368, 4464, 4487, 4722, 4887, 4961, 4974, 5035, 5054, 5103, 5475, 5582, 5792, 5911, 5917, 5956, 6019, 6240, 6315, 6561, 6742, 6746, 6767, 6818, 6953, 6970, 7021, 7307, 7317, 7336, 7485, 7523, 7779, 7824, 7869, 7908, 7970, 8034, 8081, 8091, 8130, 8240, 8249, 8307, 8367, 8528, 8579, ...], ('AA', 8): [141, 215, 376, 458, 511, 683, 715, 736, 791, 1051, 1071, 1094, 1219, 1274, 1318, 1328, 1355, 1358, 1376, 1393, 1488, 1506, 1697, 1805, 1815, 1848, 1995, 2072, 2109, 2155, 2165, 2183, 2250, 2321, 2345, 2374, 2382, 2446, 2574, 2587, 2655, 2714, 2746, 2769, 3015, 3023, 3135, 3176, 3185, 3218, 3222, 3225, 3246, 3274, 3367, 3688, 3708, 3809, 3928, 4081, 4146, 4161, 4283, 4382, 4420, 4480, 4499, 4503, 4577, 4614, 4798, 4861, 4865, 4929, 5044, 5057, 5119, 5238, 5269, 5285, 5294, 5455, 5464, 5877, 6226, 6241, 6390, 6403, 6421, 6553, 6559, 6885, 6887, 6941, 6987, 7168, 7247, 7305, 7463, 7574, ...], ('AA', 9): [71, 139, 222, 362, 417, 433, 873, 880, 882, 892, 961, 992, 1116, 1133, 1142, 1157, 1200, 1379, 1459, 1483, 1606, 1700, 1721, 1797, 1862, 2033, 2052, 2070, 2098, 2122, 2174, 2252, 2530, 2539, 2569, 2626, 2699, 2744, 2762, 2764, 2831, 2989, 3241, 3305, 3839, 3922, 4033, 4049, 4064, 4124, 4139, 4460, 4502, 4582, 4597, 4671, 4720, 4753, 4940, 5073, 5083, 5086, 5122, 5153, 5346, 5476, 5564, 5670, 5909, 5937, 5971, 6004, 6057, 6075, 6077, 6127, 6243, 6525, 6583, 6650, 6675, 6806, 6828, 7006, 7033, 7067, 7102, 7122, 7255, 7339, 7388, 7390, 7529, 7558, 7642, 7669, 7699, 7710, 7774, 7992, ...], ('AA', 10): [2, 55, 74, 298, 414, 443, 502, 505, 518, 570, 583, 594, 701, 795, 867, 955, 996, 1100, 1138, 1264, 1298, 1308, 1356, 1463, 1650, 1678, 1729, 1732, 1825, 2256, 2260, 2300, 2309, 2314, 2327, 2375, 2433, 2455, 2602, 2721, 2802, 2847, 2858, 2886, 3276, 3660, 3695, 3703, 3835, 4003, 4018, 4084, 4365, 4374, 4421, 4644, 4797, 4968, 5125, 5212, 5423, 5432, 5490, 5496, 5507, 5546, 5611, 5696, 5702, 5750, 5782, 5846, 5957, 6135, 6449, 6460, 6464, 6490, 6588, 6768, 6930, 6981, 7125, 7204, 7223, 7250, 7385, 7389, 7521, 7524, 7609, 7732, 7886, 8011, 8167, 8207, 8407, 8433, 8452, 8627, ...], ('AA', 11): [64, 82, 171, 361, 612, 751, 779, 820, 836, 894, 1134, 1150, 1206, 1420, 1470, 1481, 1743, 1846, 1938, 1952, 2049, 2106, 2180, 2257, 2439, 2460, 2514, 2590, 2637, 2697, 2709, 2879, 2887, 3086, 3173, 3219, 3237, 3240, 3290, 3331, 3426, 3577, 3587, 3640, 3651, 3691, 3777, 4207, 4262, 4289, 4298, 4300, 4336, 4340, 4380, 4488, 4675, 4719, 4739, 4801, 4884, 4912, 4965, 4976, 5037, 5252, 5407, 5420, 5472, 5625, 5707, 5843, 5867, 5897, 5920, 5930, 5947, 5959, 6007, 6159, 6503, 6657, 6745, 6880, 6901, 7026, 7035, 7062, 7093, 7117, 7178, 7182, 7212, 7240, 7499, 7682, 7796, 7818, 7963, 8202, ...], ('AA', 12): [59, 134, 160, 307, 445, 635, 782, 826, 918, 957, 958, 1113, 1281, 1322, 1399, 1413, 1491, 1556, 1629, 1710, 1728, 1763, 1813, 1921, 2063, 2445, 2567, 2600, 2689, 2760, 2795, 2811, 2851, 2883, 3010, 3098, 3111, 3300, 3513, 3641, 3746, 3826, 3840, 3861, 3872, 3907, 4112, 4133, 4216, 4325, 4401, 4505, 4532, 4563, 4605, 4632, 4639, 4723, 4759, 4781, 4816, 4875, 4906, 4967, 5031, 5075, 5102, 5151, 5191, 5200, 5397, 5401, 5527, 5549, 5747, 5841, 5857, 5901, 5938, 6079, 6249, 6251, 6276, 6323, 6370, 6436, 6521, 6562, 6636, 6870, 6932, 6939, 7031, 7049, 7080, 7096, 7207, 7245, 7606, 7633, ...], ('AS', 1): [95, 1171, 1571, 1598, 1801, 1821, 2212, 2884, 3292, 3321, 3451, 3863, 4004, 4169, 4284, 5029, 5831, 7241, 7822, 8862, 8963, 9095, 9349], ('AS', 2): [535, 853, 1105, 2219, 3006, 3120, 3291, 3379, 4377, 4730, 4908, 5154, 5339, 5382, 5533, 5763, 6340, 7738, 7898, 8076, 8417, 8471, 8511, 8844, 8850, 9174, 9742], ('AS', 3): [1272, 2418, 3398, 3431, 4774, 5061, 5108, 5179, 6172, 6337, 7270, 7415, 7672, 8996, 9534, 9673, 9991], ('AS', 4): [749, 1646, 1904, 2393, 2964, 3417, 3696, 4202, 4494, 4510, 5299, 5710, 5875, 6227, 7188, 7260, 7543, 7804, 7809, 8317, 8337, 8445, 8737, 9365, 9422], ('AS', 5): [127, 343, 560, 741, 744, 845, 1043, 1074, 2139, 2332, 3603, 3692, 4170, 4423, 4959, 5163, 5244, 5262, 5367, 5416, 5536, 6216, 6259, 6727, 6898, 7121, 7759, 8065, 8169, 8643, 8765, 9202, 9396, 9533], ('AS', 6): [313, 598, 1346, 1437, 1500, 1943, 1984, 2554, 2676, 3308, 3322, 3561, 3631, 3689, 5263, 5654, 5965, 6359, 6819, 7704, 8387, 8738, 9066, 9197], ('AS', 7): [377, 470, 774, 792, 1313, 1800, 2023, 2814, 2854, 3059, 3449, 3570, 3993, 4362, 4363, 4509, 4680, 5473, 5742, 5839, 6022, 6199, 6507, 6530, 6739, 6969, 7076, 7095, 7146, 9192], ('AS', 8): [27, 79, 167, 180, 547, 938, 1377, 1528, 1722, 2216, 2748, 2849, 3050, 3787, 3944, 4045, 4194, 4947, 5260, 5359, 5579, 5974, 6313, 6358, 7228, 7515, 8173, 8238, 8274, 8585, 8699, 8832, 9280, 9933], ('AS', 9): [679, 893, 1187, 1526, 1783, 1785, 1902, 2461, 3203, 3946, 4198, 4259, 4630, 5201, 5363, 5486, 5626, 5811, 6131, 6691, 6916, 7013, 7170, 7200, 7910, 9390, 9732], ('AS', 10): [26, 181, 1172, 1543, 1599, 2511, 4956, 5048, 5157, 5776, 5809, 6531, 7063, 8246, 8430, 9137, 9147, 9395, 9467, 9515, 9878], ('AS', 11): [18, 383, 636, 1137, 1324, 2468, 2821, 3873, 4054, 4063, 4501, 4542, 5146, 6228, 6310, 6614, 7000, 7659, 8149, 8299, 8485, 9109, 9650], ('AS', 12): [147, 207, 333, 1245, 1345, 2259, 3668, 4443, 4496, 5145, 5242, 5326, 5642, 5797, 6599, 6649, 7001, 7275, 7363, 7544, 8427, 8441, 9181, 9453, 9482, 9968], ('B6', 1): [44, 87, 647, 747, 1061, 1667, 1692, 2073, 2101, 2243, 2917, 3065, 3437, 3477, 3726, 4088, 4105, 4145, 4989, 5123, 5955, 6326, 6447, 6900, 7037, 7209, 8162, 8332, 8662, 9262, 9456, 9683], ('B6', 2): [61, 682, 699, 829, 1633, 1799, 1835, 1905, 1964, 2449, 2499, 2656, 3373, 3648, 3682, 3741, 4043, 4138, 4611, 4613, 4823, 4924, 6348, 6473, 6568, 6601, 6602, 6692, 6707, 6961, 7044, 7351, 7459, 7919, 8696, 9047, 9120, 9407, 9503, 9508, 9556, 9676], ('B6', 3): [368, 1208, 1237, 2137, 2412, 2581, 2690, 2882, 3042, 3439, 3545, 4290, 4299, 4740, 4926, 5390, 5634, 6242, 6456, 6688, 7749, 7766, 7987, 8060, 8172, 8198, 8328, 8447, 8518, 8610, 8741, 8873, 9272, 9468, 9636, 9661, 9797], ('B6', 4): [365, 452, 913, 930, 1232, 2059, 2104, 2267, 2292, 2399, 2704, 3479, 3480, 3707, 4186, 5662, 5891, 6442, 7064, 8151, 8601, 8685, 9182, 9548, 9766, 9849, 9853, 9955], ('B6', 5): [265, 385, 551, 841, 843, 1558, 1915, 2007, 2984, 3463, 3616, 3728, 3911, 3938, 4057, 4168, 4634, 4889, 5034, 5177, 5572, 5714, 6407, 6513, 6542, 6668, 6677, 6910, 6938, 7195, 8222, 8487, 8613, 8695, 8787, 8967, 9509, 9840], ('B6', 6): [144, 173, 213, 1351, 1361, 1462, 1850, 2324, 2463, 2927, 3418, 3465, 3912, 4239, 4390, 4436, 4560, 4682, 4748, 5438, 5556, 5593, 5799, 5865, 5899, 6237, 6336, 6361, 6788, 6882, 6988, 7083, 7748, 7979, 8254, 8392, 8590, 8949, 9250, 9354, 9372, 9714, 9885, 9903], ('B6', 7): [20, 111, 151, 170, 185, 217, 341, 344, 393, 976, 984, 1139, 1202, 1501, 2494, 2544, 2787, 2862, 2913, 3038, 3365, 4601, 4701, 4864, 5253, 6342, 7535, 7536, 7754, 7931, 8191, 8212, 8706, 9000, 9246, 9527, 9675], ('B6', 8): [189, 1039, 1193, 1482, 1871, 1923, 2220, 2919, 2949, 2963, 3101, 4163, 4415, 4432, 5028, 5187, 5271, 5681, 6209, 6429, 6508, 7398, 7701, 7905, 8181, 8322, 8363, 8730, 8913, 9218, 9969], ('B6', 9): [23, 370, 1112, 1254, 1480, 2103, 2110, 2210, 2237, 2692, 2901, 2924, 3004, 3073, 3399, 3421, 3607, 3674, 4196, 4316, 4357, 4387, 4640, 4999, 5097, 5418, 5483, 5749, 6183, 6294, 6740, 7358, 7590, 7857, 7877, 8052, 8245, 8596, 9303, 9815], ('B6', 10): [209, 296, 585, 1089, 1132, 1918, 2189, 2850, 2907, 2982, 3375, 3411, 3413, 3536, 3621, 3645, 3891, 3919, 4434, 4583, 5008, 5010, 5228, 5537, 6078, 6392, 6410, 6524, 6696, 6934, 7078, 7386, 7464, 7915, 7936, 8085, 8684, 9136, 9440, 9592], ('B6', 11): [51, 428, 675, 986, 1166, 1239, 1440, 1567, 1711, 1847, 2194, 2498, 2968, 3202, 3208, 3393, 3733, 3769, 4034, 4287, 5517, 6576, 6908, 7235, 7327, 7483, 8124, 8285, 8533, 8793, 8945, 8971, 9065, 9514, 9522, 9630, 9687, 9820], ('B6', 12): [231, 263, 500, 530, 576, 840, 1177, 1199, 1297, 1583, 1819, 2061, 2129, 2304, 2578, 2955, 3035, 3539, 3565, 4071, 4337, 4581, 5025, 5118, 5566, 6093, 6384, 6529, 6538, 6770, 6835, 6937, 6942, 7119, 7564, 8123, 8448, 8488, 8897, 9191, 9208, 9470, 9784], ('DL', 1): [99, 286, 519, 590, 591, 879, 909, 1092, 1350, 1478, 1657, 1826, 1969, 2000, 2015, 2105, 2132, 2151, 2583, 2603, 2607, 2639, 2717, 2783, 2925, 3146, 3209, 3303, 3323, 3336, 3410, 3443, 3540, 3657, 3764, 3914, 3956, 3957, 4030, 4176, 4282, 4391, 4451, 4457, 4537, 4756, 4820, 4898, 4911, 4953, 5053, 5173, 5337, 5354, 5581, 5639, 5711, 5785, 5818, 5953, 6040, 6089, 6417, 6603, 6627, 6804, 6807, 6836, 6924, 6940, 7030, 7131, 7238, 7301, 7505, 7507, 7591, 7664, 7714, 7798, 7947, 7975, 8013, 8037, 8221, 8303, 8315, 8394, 8460, 8537, 8769, 8835, 8876, 8933, 8938, 9080, 9153, 9180, 9278, 9295, ...], ('DL', 2): [39, 67, 113, 154, 220, 274, 292, 435, 438, 615, 656, 851, 901, 989, 1015, 1364, 1368, 1486, 1534, 1553, 1591, 1686, 1714, 2025, 2057, 2099, 2185, 2346, 2486, 2521, 3126, 3338, 3453, 3472, 3522, 3776, 3793, 3823, 3909, 3964, 3979, 4039, 4270, 4320, 4372, 4492, 4610, 4628, 4654, 4745, 4960, 5105, 5114, 5148, 5230, 5291, 5395, 5406, 5448, 5769, 5928, 5935, 6010, 6025, 6084, 6179, 6192, 6284, 6371, 6497, 6716, 6781, 6816, 6841, 6906, 6922, 6944, 7009, 7175, 7184, 7227, 7252, 7372, 7384, 7404, 7512, 7546, 7670, 7817, 7871, 7874, 7989, 8165, 8204, 8316, 8333, 8413, 8439, 8577, 8700, ...], ('DL', 3): [148, 153, 312, 322, 374, 480, 548, 672, 723, 733, 813, 944, 960, 1068, 1099, 1104, 1161, 1424, 1464, 1581, 1586, 1705, 1736, 1751, 1857, 1900, 1942, 1981, 2030, 2077, 2164, 2215, 2236, 2479, 2528, 2592, 2613, 2664, 2817, 2840, 2906, 2914, 2990, 3332, 3498, 3559, 3591, 3615, 3624, 3662, 3782, 4083, 4185, 4195, 4264, 4285, 4309, 4517, 4616, 4626, 4660, 4698, 4699, 4712, 5052, 5060, 5069, 5225, 5249, 5277, 5350, 5562, 5645, 5649, 6067, 6148, 6363, 6485, 6644, 6704, 6744, 6754, 6826, 6854, 6872, 6896, 7046, 7068, 7169, 7202, 7210, 7236, 7283, 7348, 7480, 7487, 7651, 7706, 7716, 7903, ...], ('DL', 4): [14, 145, 206, 244, 316, 514, 540, 700, 1019, 1034, 1048, 1148, 1151, 1176, 1227, 1390, 1445, 1448, 1521, 1531, 1573, 1584, 1596, 1679, 1830, 1832, 1870, 1881, 1990, 2019, 2074, 2208, 2226, 2230, 2278, 2297, 2400, 2415, 2557, 2605, 2778, 2908, 2936, 2945, 3022, 3114, 3134, 3210, 3326, 3330, 3438, 3605, 3638, 3732, 3751, 3752, 3827, 3855, 4140, 4288, 4398, 4463, 4498, 4566, 4684, 4749, 4809, 4828, 4881, 4883, 4985, 5147, 5241, 5259, 5333, 5586, 5686, 5688, 5703, 5859, 5914, 5990, 6046, 6064, 6071, 6143, 6145, 6231, 6353, 6700, 6705, 6760, 6791, 6827, 6861, 7034, 7143, 7186, 7395, 7458, ...], ('DL', 5): [123, 258, 389, 394, 496, 559, 661, 703, 814, 963, 1144, 1154, 1203, 1441, 1474, 1502, 1510, 1637, 1712, 1746, 1755, 1775, 1867, 2044, 2143, 2222, 2245, 2331, 2388, 2402, 2411, 2501, 2677, 2772, 2983, 3008, 3032, 3269, 3366, 3529, 3537, 3560, 3761, 3865, 4048, 4094, 4136, 4324, 4412, 4533, 4571, 4645, 4674, 4687, 4858, 4862, 4966, 4970, 4981, 5041, 5058, 5182, 5204, 5221, 5268, 5293, 5340, 5380, 5433, 5460, 5487, 5724, 5734, 5804, 5828, 6175, 6266, 6277, 6432, 6435, 6441, 6519, 6669, 6724, 6975, 7028, 7140, 7166, 7172, 7193, 7286, 7418, 7449, 7468, 7516, 7690, 7721, 7731, 7762, 7858, ...], ('DL', 6): [47, 72, 85, 158, 159, 228, 336, 386, 410, 561, 601, 713, 716, 737, 750, 803, 834, 850, 868, 980, 1022, 1173, 1218, 1255, 1258, 1300, 1372, 1443, 1457, 1572, 1665, 1668, 1703, 1809, 1859, 1967, 2042, 2065, 2120, 2269, 2417, 2448, 2604, 2681, 2798, 2896, 2904, 3087, 3180, 3264, 3356, 3478, 3511, 3722, 3902, 3905, 4009, 4014, 4098, 4265, 4564, 4607, 4663, 4666, 4765, 4839, 4877, 4903, 4930, 4932, 5007, 5218, 5330, 5393, 5405, 5516, 5638, 5709, 5731, 5758, 5832, 5883, 5944, 5949, 5954, 5989, 6016, 6036, 6108, 6144, 6210, 6448, 6474, 6604, 6630, 6662, 6765, 6862, 6877, 6902, ...], ('DL', 7): [119, 137, 233, 381, 415, 508, 538, 707, 717, 854, 954, 982, 994, 1123, 1278, 1286, 1579, 1698, 1720, 1776, 1865, 2022, 2039, 2116, 2126, 2142, 2232, 2253, 2323, 2441, 2462, 2577, 2593, 2625, 2653, 2791, 2794, 2809, 2835, 2905, 2992, 3079, 3167, 3572, 3613, 3617, 3675, 3713, 3735, 3850, 3874, 4026, 4257, 4275, 4335, 4378, 4425, 4433, 4475, 4524, 4573, 4585, 4589, 4656, 4721, 4859, 4868, 4907, 5011, 5099, 5165, 5172, 5300, 5366, 5457, 5695, 5705, 5794, 5805, 5830, 5885, 5902, 6053, 6128, 6162, 6177, 6182, 6186, 6191, 6194, 6466, 6512, 6526, 6545, 6563, 6586, 6697, 6703, 6741, 6834, ...], ('DL', 8): [33, 402, 714, 725, 734, 783, 862, 1119, 1256, 1564, 1652, 1816, 1820, 1888, 1944, 1978, 1997, 2038, 2087, 2378, 2536, 2552, 2633, 2784, 2786, 2793, 2938, 3024, 3102, 3140, 3149, 3236, 3286, 3293, 3360, 3473, 3595, 3628, 3685, 3750, 3887, 3913, 3927, 3986, 4106, 4271, 4355, 4370, 4491, 4551, 4670, 4704, 4734, 4863, 4933, 4977, 4988, 5021, 5109, 5236, 5250, 5338, 5424, 5426, 5431, 5444, 5451, 5603, 5808, 5834, 6054, 6062, 6090, 6120, 6123, 6195, 6207, 6219, 6455, 6467, 6523, 6547, 6592, 6663, 6805, 6815, 6847, 6871, 7065, 7130, 7213, 7299, 7362, 7496, 7502, 7517, 7643, 7666, 7677, 7707, ...], ('DL', 9): [40, 232, 248, 323, 412, 413, 416, 525, 689, 724, 756, 764, 922, 936, 948, 950, 1025, 1093, 1247, 1342, 1374, 1382, 1401, 1507, 1593, 1661, 1704, 1804, 1903, 1939, 2187, 2333, 2376, 2519, 2546, 2631, 2679, 2702, 3064, 3130, 3170, 3195, 3244, 3350, 3396, 3500, 3564, 3679, 3724, 3743, 3834, 3906, 3945, 3949, 3959, 3989, 4040, 4058, 4129, 4217, 4231, 4256, 4291, 4367, 4371, 4417, 4507, 4696, 4831, 4904, 4943, 4972, 5130, 5233, 5428, 5440, 5480, 5492, 5608, 5683, 5692, 6052, 6129, 6174, 6245, 6385, 6585, 6608, 6634, 6755, 6757, 6776, 6780, 6874, 6905, 7199, 7481, 7649, 7700, 7795, ...], ('DL', 10): [80, 90, 91, 277, 360, 378, 391, 444, 446, 471, 539, 619, 674, 697, 709, 775, 861, 897, 1001, 1009, 1013, 1028, 1087, 1090, 1182, 1210, 1402, 1423, 1431, 1447, 1477, 1628, 1639, 1660, 1782, 1810, 1839, 1854, 1936, 2036, 2097, 2200, 2286, 2435, 2547, 2730, 2816, 2839, 2912, 2987, 3125, 3129, 3133, 3161, 3214, 3329, 3339, 3386, 3441, 3459, 3484, 3486, 3543, 3620, 3652, 3686, 3745, 3766, 3771, 3870, 4008, 4132, 4159, 4165, 4166, 4188, 4189, 4190, 4206, 4348, 4373, 4381, 4386, 4422, 4545, 4681, 4850, 4920, 5030, 5045, 5047, 5196, 5248, 5439, 5535, 5561, 5591, 5768, 5806, 5854, ...], ('DL', 11): [22, 192, 382, 481, 491, 584, 624, 643, 1103, 1325, 1403, 1410, 1414, 1485, 1604, 2050, 2179, 2261, 2265, 2377, 2413, 2564, 2674, 2828, 2932, 2960, 3018, 3044, 3057, 3096, 3154, 3285, 3394, 3404, 3416, 3435, 3516, 3594, 3622, 3670, 3821, 3879, 3883, 4015, 4059, 4100, 4110, 4192, 4230, 4484, 4661, 4752, 4827, 4855, 4890, 4895, 4957, 5017, 5043, 5278, 5295, 5307, 5325, 5355, 5394, 5730, 5732, 5860, 5888, 6130, 6235, 6301, 6317, 6367, 6399, 6452, 6658, 6664, 6698, 6714, 6751, 6778, 6947, 7018, 7045, 7091, 7118, 7132, 7190, 7456, 7457, 7569, 7650, 7844, 7904, 7974, 8042, 8109, 8272, 8300, ...], ('DL', 12): [77, 138, 165, 172, 253, 256, 522, 536, 558, 902, 952, 981, 993, 1082, 1186, 1246, 1430, 1454, 1472, 1580, 1757, 1779, 1781, 1823, 2031, 2178, 2199, 2457, 2615, 2665, 2855, 2875, 2988, 3070, 3312, 3334, 3392, 3474, 3523, 3550, 3643, 3815, 3941, 4086, 4178, 4253, 4301, 4322, 4397, 4470, 4620, 4677, 4897, 4901, 5197, 5522, 5568, 5605, 5729, 5761, 6060, 6180, 6275, 6292, 6478, 6500, 6510, 6552, 6618, 6665, 6849, 6869, 6933, 6992, 7040, 7073, 7139, 7189, 7285, 7466, 7607, 7626, 7785, 7836, 8206, 8250, 8339, 8623, 8709, 8823, 9049, 9179, 9288, 9366, 9521, 9575, 9591, 9691, 9738, 9740, ...], ('EV', 1): [69, 557, 695, 977, 1284, 1505, 1566, 1623, 1648, 1853, 2001, 2014, 2275, 2291, 2350, 2370, 2406, 2648, 2671, 2673, 2765, 3013, 3099, 3216, 3270, 3347, 3978, 4023, 4153, 4538, 4726, 4762, 4949, 5024, 5038, 5170, 5501, 5677, 5983, 5988, 6015, 6152, 6352, 6377, 6633, 6721, 6851, 6949, 7198, 7399, 7440, 7452, 7511, 7587, 7636, 7715, 7830, 8286, 8310, 8380, 8403, 8475, 8567, 8780, 8937, 9289, 9347, 9360, 9377, 9597, 9817, 9946, 9986], ('EV', 2): [109, 324, 369, 398, 423, 533, 684, 807, 1523, 1664, 1683, 1758, 1858, 1896, 1963, 2075, 2214, 2369, 2500, 2526, 2638, 2724, 2804, 2833, 2866, 3056, 3071, 3282, 3499, 3606, 4109, 4117, 4125, 4212, 4247, 4268, 4438, 4786, 4844, 5189, 5329, 5502, 5617, 5668, 5786, 5787, 5837, 5946, 6095, 6119, 6761, 7020, 7232, 7367, 7447, 7555, 7954, 8046, 8463, 8652, 8668, 8739, 8770, 8792, 8909, 8914, 9012, 9075, 9102, 9110, 9505, 9706, 9901, 9972, 9992], ('EV', 3): [88, 129, 546, 706, 1035, 1085, 1249, 1262, 1277, 1357, 1406, 1551, 1640, 1691, 1845, 2221, 2266, 2273, 2467, 2571, 2610, 2641, 2782, 3178, 3247, 3252, 3496, 3524, 3584, 3592, 3623, 3718, 3846, 4107, 4410, 4653, 4657, 4857, 5159, 5184, 5303, 5336, 5515, 5618, 5746, 5756, 5766, 5880, 6165, 6185, 6533, 6595, 6598, 6763, 6829, 7226, 7319, 7330, 7340, 7406, 7503, 7554, 7695, 7705, 7845, 7885, 7941, 8036, 8087, 8119, 8275, 8443, 8467, 8527, 8529, 8542, 8548, 8580, 8692, 8694, 8728, 8974, 8980, 

### Aggregations after GroupBy

For example, let us say you want to find out the average distance traveled by each airline, you can do that using the following aggregeate function

In [20]:
flights.head()

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
0,2015,8,19,3,EV,3260,7.0,20.0,1091
1,2015,9,23,3,WN,3050,4.0,9.0,837
2,2015,10,16,5,AA,1382,13.0,25.0,761
3,2015,1,19,1,WN,4274,5.0,23.0,1547
4,2015,4,22,3,WN,2237,5.0,18.0,872

In [21]:
flights_by_airline = flights.groupby(['AIRLINE'])

In [22]:
avg_by_airline = flights_by_airline[['DISTANCE', 'TAXI_IN']].mean()

**NOTE**: The double [[ ]] for computing the summary stististics. The first pair [] is used to look into the `DataFrameGroupyBy` object the second pair [] is used to list all the columns you want to produce the summary statistics.

In [23]:
avg_by_airline

            DISTANCE    TAXI_IN
AIRLINE
AA       1053.736842   9.092593
AS       1202.405145   6.443730
B6       1064.124444   5.966216
DL        862.416996   7.279392
EV        466.038961   7.700409
F9       1034.223776  10.188811
HA        789.768595   7.214876
MQ        433.701961   8.512397
NK        993.298578   8.908213
OO        516.424537   6.725919
UA       1243.796421   8.638225
US        952.810000   7.872414
VX       1418.900000   7.587156
WN        722.505027   6.247911

## Activity


### Gerneralizing using GroupBy

1\. Use AIRLINE to `groupby` records into a `DataFrameGroupBy` object?

2\. Compute the median distnace travelled per airline. 

3\. Extract the median DISTANCE for SouthWest airlines (WN) and assign it a variable `median_distance_WN`. 

4\. What is the median DISTANCE, TAXI_IN times and TAXI_OUT times per airline per month? 

5\. Extract the median TAXI_OUT for SouthWest airlines (WN) in December (12) and assign it a variable `median_taxi_out_WN_12`.

In [ ]:
# Question 1
flights_by_airline = flights.groupby(['AIRLINE'])

In [24]:
# Question 2
median_distance = flights_by_airline[['DISTANCE']].median()
median_distance

         DISTANCE
AIRLINE
AA          985.0
AS          954.0
B6          997.0
DL          666.0
EV          429.0
F9          927.0
HA          163.0
MQ          408.0
NK          977.0
OO          451.0
UA         1023.0
US          705.5
VX         1313.5
WN          611.0

In [26]:
median_distance.loc['WN']['DISTANCE']

611.0

In [27]:
# Question 3
median_distance_WN = median_distance.loc['WN']['DISTANCE']

In [28]:
# Question 4
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])
summary_by_airline_month = flights_by_airline_month[['DISTANCE', 'TAXI_IN', 'TAXI_OUT']].median()
summary_by_airline_month

               DISTANCE  TAXI_IN  TAXI_OUT
AIRLINE MONTH
AA      1        1061.0      7.0      15.0
        2         932.5      8.0      14.0
        3        1089.0      8.0      16.0
        4        1045.0      9.0      17.0
        5        1050.0      7.0      15.0
...                 ...      ...       ...
WN      8         577.0      5.0      10.0
        9         562.0      5.0      11.0
        10        601.5      5.0      10.0
        11        577.0      5.0      11.0
        12        670.0      5.0      10.0

[162 rows x 3 columns]

In [31]:
summary_by_airline_month.loc['WN'].loc[12]['TAXI_OUT']

10.0

In [32]:
summary_by_airline_month.loc['WN',12]['TAXI_OUT']

10.0

In [33]:
#Question 5: Select WN airline in month 12, median TAXI_OUT
median_taxi_out_WN_12 = summary_by_airline_month.loc['WN'].loc[12]['TAXI_OUT']

### Understanding the Aggregation After GroupBy: Method Dispatching

Let us now understand how the Aggregations on the DataFrameGroupBy objects work. In the **`DataFrameGroupBy`** objects, any method not found on the object itself is forwarded ("**dispatched**") to all the groups that it contains.

That is why we were able to ask for the *`median`* of a **`flights_by_airline`** object above and get something back: it is (1) "dispatching" the *`median`* method call to each group (that is each airline), (2) collecting the results and (3) presenting them to us.

In [34]:
flights_by_airline = flights.groupby(['AIRLINE'])

In [35]:
flights_by_airline.median()

,YEAR,MONTH,DAY,DAY_OF_WEEK,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
AIRLINE,,,,,,,,
AA,2015.0,8.0,16.0,4.0,1292.0,7.0,15.0,985.0
AS,2015.0,7.0,15.0,4.0,384.0,5.0,14.0,954.0
B6,2015.0,7.0,16.0,4.0,749.0,5.0,15.0,997.0
DL,2015.0,7.0,15.0,4.0,1654.5,6.0,15.0,666.0
EV,2015.0,6.0,15.0,4.0,4891.0,7.0,15.0,429.0
F9,2015.0,7.0,14.0,4.0,720.0,8.0,13.0,927.0
HA,2015.0,6.0,16.0,4.0,214.0,6.0,11.0,163.0
MQ,2015.0,6.0,14.0,4.0,3301.5,6.0,14.0,408.0
NK,2015.0,7.0,16.0,4.0,511.0,7.0,12.0,977.0
OO,2015.0,6.0,16.0,4.0,5265.0,5.0,16.0,451.0
UA,2015.0,7.0,16.0,4.0,1141.5,7.0,15.0,1023.0
US,2015.0,3.0,16.5,4.0,1717.0,6.0,16.0,705.5
VX,2015.0,8.0,14.0,3.5,490.5,7.0,12.0,1313.5
WN,2015.0,7.0,16.0,4.0,1516.0,5.0,10.0,611.0

In [36]:
# Compute the median for the entire DataFrameGroupBy object and then select 'DISTANCE' column 
flights_by_airline.median()[['DISTANCE']]

         DISTANCE
AIRLINE
AA          985.0
AS          954.0
B6          997.0
DL          666.0
EV          429.0
F9          927.0
HA          163.0
MQ          408.0
NK          977.0
OO          451.0
UA         1023.0
US          705.5
VX         1313.5
WN          611.0

In [37]:
# Select the 'DISTANCE' Column and then compute the median
flights_by_airline[['DISTANCE']].median()

         DISTANCE
AIRLINE
AA          985.0
AS          954.0
B6          997.0
DL          666.0
EV          429.0
F9          927.0
HA          163.0
MQ          408.0
NK          977.0
OO          451.0
UA         1023.0
US          705.5
VX         1313.5
WN          611.0

**Question**: Which of the above two methods should be preferred?

In [38]:
# Select the 'DISTANCE' Column and then compute the median. THIS GIVES YOU SERIES OBJECT. 
flights_by_airline['DISTANCE'].median()

AIRLINE
AA     985.0
AS     954.0
B6     997.0
DL     666.0
EV     429.0
F9     927.0
HA     163.0
MQ     408.0
NK     977.0
OO     451.0
UA    1023.0
US     705.5
VX    1313.5
WN     611.0
Name: DISTANCE, dtype: float64

**NOTE** Note difference between using double square brackets [[ ]] and single bracket [ ]. For example, ``flights_by_airline[['DISTANCE']].median()`` above is a Dataframe with one column, where as if you use `` flights_by_airline['DISTANCE'].median()`` it'll give you a Series.

### Methods of `DataFrameGroupBy` Objects
Now we will understand the various operations built into the `DataFrameGroupBy` object type.

#### The `aggregate()` Method
At first, the `aggregate()` method appears to be quite similiar to what we just covered when we talked about method dispatching. It performs aggregations on the groups in a **`DataFrameGroupBy`** object.

In [39]:
flights_by_airline.aggregate('mean')

,YEAR,MONTH,DAY,DAY_OF_WEEK,FLIGHT_NUMBER,TAXI_IN,TAXI_OUT,DISTANCE
AIRLINE,,,,,,,,
AA,2015.0,7.097862,16.024671,4.055921,1266.090461,9.092593,17.785354,1053.736842
AS,2015.0,6.565916,15.356913,3.996785,386.385852,6.443730,15.073955,1202.405145
B6,2015.0,6.653333,15.771111,3.893333,905.420000,5.966216,18.231982,1064.124444
DL,2015.0,6.551383,15.486825,3.887352,1631.198287,7.279392,17.189564,862.416996
EV,2015.0,6.408591,15.355644,3.851149,4742.821179,7.700409,16.813456,466.038961
F9,2015.0,7.181818,15.762238,3.790210,775.594406,10.188811,16.335664,1034.223776
HA,2015.0,6.239669,16.140496,3.809917,209.578512,7.214876,11.115702,789.768595
MQ,2015.0,6.247059,14.858824,3.917647,3304.494118,8.512397,16.628099,433.701961
NK,2015.0,6.706161,15.938389,3.976303,534.971564,8.908213,14.318841,993.298578
OO,2015.0,6.347614,16.034080,3.938656,5193.527751,6.725919,17.864945,516.424537
UA,2015.0,6.505593,15.480984,3.947427,1062.827740,8.638225,16.754545,1243.796421
US,2015.0,3.463333,15.883333,3.883333,1300.463333,7.872414,18.600000,952.810000
VX,2015.0,7.445455,15.309091,3.572727,568.563636,7.587156,14.917431,1418.900000
WN,2015.0,6.569470,16.072212,3.973492,1831.462066,6.247911,11.931787,722.505027

The difference is that the **`aggregate()`** method gives you some additional options that are not available if you rely on method dispatching as shown above.

In [41]:
# You can pass multiple aggregates as a list.
# Here will we get various aggregates for each
# column of our flights_by_airline object.
#flights_by_airline.aggregate([np.mean, 'min', 'max'])

flights_by_airline.aggregate(['mean', 'min', 'max'])

         YEAR                 MONTH                DAY         DAY_OF_WEEK  \
         mean   min   max      mean min max       mean min max        mean
AIRLINE
AA       2015  2015  2015  7.097862   1  12  16.024671   1  31    4.055921
AS       2015  2015  2015  6.565916   1  12  15.356913   1  31    3.996785
B6       2015  2015  2015  6.653333   1  12  15.771111   1  31    3.893333
DL       2015  2015  2015  6.551383   1  12  15.486825   1  31    3.887352
EV       2015  2015  2015  6.408591   1  12  15.355644   1  31    3.851149
F9       2015  2015  2015  7.181818   1  12  15.762238   1  31    3.790210
HA       2015  2015  2015  6.239669   1  12  16.140496   1  31    3.809917
MQ       2015  2015  2015  6.247059   1  12  14.858824   1  31    3.917647
NK       2015  2015  2015  6.706161   1  12  15.938389   1  31    3.976303
OO       2015  2015  2015  6.347614   1  12  16.034080   1  31    3.938656
UA       2015  2015  2015  6.505593   1  12  15.480984   1  31    3.947427
US       2015  2015  2015  3.463333   1   6  15.883333   1  31    3.883333
VX       2015  2015  2015  7.445455   1  12  15.309091   1  31    3.572727
WN       2015  2015  2015  6.569470   1  12  16.072212   1  31    3.973492

         ... FLIGHT_NUMBER    TAXI_IN              TAXI_OUT              \
         ...           max       mean  min   max       mean  min    max
AIRLINE  ...
AA       ...          2580   9.092593  2.0  60.0  17.785354  7.0  110.0
AS       ...           895   6.443730  2.0  24.0  15.073955  3.0   88.0
B6       ...          2784   5.966216  2.0  38.0  18.231982  7.0   81.0
DL       ...          2853   7.279392  1.0  68.0  17.189564  7.0  105.0
EV       ...          6189   7.700409  2.0  47.0  16.813456  3.0  144.0
F9       ...          1491  10.188811  4.0  45.0  16.335664  7.0   53.0
HA       ...           520   7.214876  3.0  22.0  11.115702  5.0   26.0
MQ       ...          3691   8.512397  1.0  66.0  16.628099  4.0  167.0
NK       ...          1104   8.908213  2.0  71.0  14.318841  7.0   63.0
OO       ...          7432   6.725919  2.0  46.0  17.864945  4.0   78.0
UA       ...          2032   8.638225  2.0  87.0  16.754545  7.0   73.0
US       ...          2192   7.872414  2.0  59.0  18.600000  8.0  149.0
VX       ...          1935   7.587156  2.0  37.0  14.917431  7.0   69.0
WN       ...          6819   6.247911  1.0  66.0  11.931787  1.0   99.0

            DISTANCE
                mean  min   max
AIRLINE
AA       1053.736842  130  3784
AS       1202.405145   31  2846
B6       1064.124444   68  2704
DL        862.416996   74  4502
EV        466.038961   69  1330
F9       1034.223776  373  2218
HA        789.768595   84  2917
MQ        433.701961   89  1236
NK        993.298578  177  2381
OO        516.424537   67  1735
UA       1243.796421  137  4962
US        952.810000  130  2979
VX       1418.900000  189  2704
WN        722.505027  148  2447

[14 rows x 24 columns]

<div class="alert alert-block alert-warning">
<p>
It is important to notice that you are able to pass both strings and functions to the `aggregate()` method. It is probably best to choose one approach and stick with it rather than mixing and matching like I've done here.
</p>
</div>

In [42]:
flights_by_airline.aggregate([np.mean, np.min, np.max])

         YEAR                 MONTH                  DAY            \
         mean  amin  amax      mean amin amax       mean amin amax
AIRLINE
AA       2015  2015  2015  7.097862    1   12  16.024671    1   31
AS       2015  2015  2015  6.565916    1   12  15.356913    1   31
B6       2015  2015  2015  6.653333    1   12  15.771111    1   31
DL       2015  2015  2015  6.551383    1   12  15.486825    1   31
EV       2015  2015  2015  6.408591    1   12  15.355644    1   31
F9       2015  2015  2015  7.181818    1   12  15.762238    1   31
HA       2015  2015  2015  6.239669    1   12  16.140496    1   31
MQ       2015  2015  2015  6.247059    1   12  14.858824    1   31
NK       2015  2015  2015  6.706161    1   12  15.938389    1   31
OO       2015  2015  2015  6.347614    1   12  16.034080    1   31
UA       2015  2015  2015  6.505593    1   12  15.480984    1   31
US       2015  2015  2015  3.463333    1    6  15.883333    1   31
VX       2015  2015  2015  7.445455    1   12  15.309091    1   31
WN       2015  2015  2015  6.569470    1   12  16.072212    1   31

        DAY_OF_WEEK  ... FLIGHT_NUMBER    TAXI_IN              TAXI_OUT       \
               mean  ...          amax       mean amin  amax       mean amin
AIRLINE              ...
AA         4.055921  ...          2580   9.092593  2.0  60.0  17.785354  7.0
AS         3.996785  ...           895   6.443730  2.0  24.0  15.073955  3.0
B6         3.893333  ...          2784   5.966216  2.0  38.0  18.231982  7.0
DL         3.887352  ...          2853   7.279392  1.0  68.0  17.189564  7.0
EV         3.851149  ...          6189   7.700409  2.0  47.0  16.813456  3.0
F9         3.790210  ...          1491  10.188811  4.0  45.0  16.335664  7.0
HA         3.809917  ...           520   7.214876  3.0  22.0  11.115702  5.0
MQ         3.917647  ...          3691   8.512397  1.0  66.0  16.628099  4.0
NK         3.976303  ...          1104   8.908213  2.0  71.0  14.318841  7.0
OO         3.938656  ...          7432   6.725919  2.0  46.0  17.864945  4.0
UA         3.947427  ...          2032   8.638225  2.0  87.0  16.754545  7.0
US         3.883333  ...          2192   7.872414  2.0  59.0  18.600000  8.0
VX         3.572727  ...          1935   7.587156  2.0  37.0  14.917431  7.0
WN         3.973492  ...          6819   6.247911  1.0  66.0  11.931787  1.0

                   DISTANCE
          amax         mean amin  amax
AIRLINE
AA       110.0  1053.736842  130  3784
AS        88.0  1202.405145   31  2846
B6        81.0  1064.124444   68  2704
DL       105.0   862.416996   74  4502
EV       144.0   466.038961   69  1330
F9        53.0  1034.223776  373  2218
HA        26.0   789.768595   84  2917
MQ       167.0   433.701961   89  1236
NK        63.0   993.298578  177  2381
OO        78.0   516.424537   67  1735
UA        73.0  1243.796421  137  4962
US       149.0   952.810000  130  2979
VX        69.0  1418.900000  189  2704
WN        99.0   722.505027  148  2447

[14 rows x 24 columns]

Your textbook also talks about using a dict to apply labels to the aggregation columns so that they can have user friendly names like 'Longest Distance' rather than just 'max'.

This sort of functionality is, however, deprecated in Pandas, which means that it will be removed in future versions.

To accomplish the same thing, we should instead append a `rename()` method after our `aggregate()` method like so:

In [45]:
# Using `rename()` to apply friendly labels to output columns
flights_by_airline['DISTANCE'].aggregate(
    [np.mean, np.min, np.max]).rename(
        columns={'mean': 'Avg. Distance', 
                 'amin': 'Shortest Distance', 
                 'amax': 'Longest Distance'})

         Avg. Distance  Shortest Distance  Longest Distance
AIRLINE
AA         1053.736842                130              3784
AS         1202.405145                 31              2846
B6         1064.124444                 68              2704
DL          862.416996                 74              4502
EV          466.038961                 69              1330
F9         1034.223776                373              2218
HA          789.768595                 84              2917
MQ          433.701961                 89              1236
NK          993.298578                177              2381
OO          516.424537                 67              1735
UA         1243.796421                137              4962
US          952.810000                130              2979
VX         1418.900000                189              2704
WN          722.505027                148              2447

<div class="alert alert-block alert-danger">
<p>
Note, there are three main things happening in the above statement. 

<li> flights_by_airline['DISTANCE'] selects the distance column for analysis
<li> flights_by_airline['DISTANCE'].aggregate([np.mean, np.min, np.max]) computes the average, min and max of the distance column selected
<li> Finally .rename() function is appropriately renaming the columns according the dictionary we have given  
</p>
</div>

The recommended way of using a **`dict`** with the **`aggregate()`** method is actually to specify which aggregation(s) to perform on what columns. You can use it to specify different aggregation(s) on a per-column basis.

Here I'll use it to get the high/low values for DISTANCE and the mean for TAXI_IN on our *`flights_by_airline_month`* object.

In [46]:
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])

# Notice how using this style automatically filters
# out all columns you don't specify.
flights_by_airline_month.aggregate(
        {'DISTANCE': [np.min, np.max], 
         'TAXI_IN': np.mean}).tail(20)

              DISTANCE         TAXI_IN
                  amin  amax      mean
AIRLINE MONTH
VX      5          414  2704  8.000000
        6          337  2586  8.000000
        7          189  2454  7.285714
        8          337  2704  7.000000
        9          236  2475  6.000000
        10         236  2475  7.294118
        11         236  2565  7.187500
        12         337  2586  7.333333
WN      1          148  2447  6.519337
        2          148  2039  5.715278
        3          223  2253  5.944751
        4          148  2335  6.071429
        5          189  2447  5.736842
        6          187  2335  6.666667
        7          187  2447  7.418848
        8          189  2329  5.937500
        9          148  2335  5.687500
        10         148  2295  6.312500
        11         187  1892  6.273196
        12         148  2106  6.395833

## Activity: 

We will work again on the `college-loan-default-rates.csv` and `college-scorecard-data-scrubbed.csv` datasets. 

Use `aggregate()` method to produce

1. The average, minimum and maximum `full_time_retention_rate_4_year` per state using `college-scorecard-data-scrubbed.csv` dataset. 
    * After producing the above summary statistics, make sure you rename your columns for average, minimum and maximum as `Avg. Retention`, `Low Retention`, and `High Retention` respectively. 

2. Which state has the highest average four year retention rate (`full_time_retention_rate_4_year`)? Which has the lowest average? 

3. Produce per state and city, minimum and maximum for the `sat_average` column and average for the `full_time_retention_rate_4_year` column.

In [47]:
# For this tutorial, we will need both of our datasets.
college_loan_defaults = pd.read_csv(
    './data/college-loan-default-rates.csv')

college_scorecard = pd.read_csv(
    './data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1')

In [49]:
# Question 1

college_by_state = college_scorecard.groupby(['state'])
retention_summary = college_by_state['full_time_retention_rate_4_year'].aggregate(['mean', 'min', 'max'])
retention_summary.head()

           mean     min     max
state
AK     0.663240  0.3333  0.7756
AL     0.615436  0.0000  1.0000
AR     0.650996  0.2564  0.8667
AS     1.000000  1.0000  1.0000
AZ     0.679600  0.2000  1.0000

In [52]:
# Question 1 (contd...)
retention_summary = retention_summary.rename(columns = {'mean':'Avg. Retention',
                                                       'min': 'Low Retention',
                                                       'max': 'High Retention'})
retention_summary.head()

       Avg. Retention  Low Retention  High Retention
state
AK           0.663240         0.3333          0.7756
AL           0.615436         0.0000          1.0000
AR           0.650996         0.2564          0.8667
AS           1.000000         1.0000          1.0000
AZ           0.679600         0.2000          1.0000

In [53]:
# Question 2
retention_summary['Avg. Retention'].idxmax()

'AS'

In [54]:
retention_summary['Avg. Retention'].idxmin()

'CO'

In [55]:
# Question 3
college_by_state_city = college_scorecard.groupby(['state', 'city'])

college_by_state_city.aggregate({'sat_average':['min','max'], 
                                 'full_time_retention_rate_4_year': np.mean})

                   sat_average         full_time_retention_rate_4_year
                           min     max                            mean
state city
AK    Anchorage         1054.0  1054.0                          0.7453
      Barrow               NaN     NaN                             NaN
      Fairbanks            NaN     NaN                          0.7756
      Juneau               NaN     NaN                          0.7167
      Palmer               NaN     NaN                          0.3333
...                        ...     ...                             ...
WY    Powell               NaN     NaN                             NaN
      Riverton             NaN     NaN                             NaN
      Rock Springs         NaN     NaN                             NaN
      Sheridan             NaN     NaN                             NaN
      Torrington           NaN     NaN                             NaN

[2923 rows x 3 columns]

<div class="alert alert-block alert-warning">
<h3> Important Notes</h3>
<p> </p> 
When producing any of the summary statistics using group by, you can assign your intermediate operations to the variables. In the entire section above, I have been mostly trying to produce the results to show them to you. However, you can assign the results to a variable for using it in the future. **See the example below.** 
</div>

In [56]:
flights_by_airline_month = flights.groupby(['AIRLINE', 'MONTH'])
summary_distanc_taxi_in = flights_by_airline_month.aggregate(
        {'DISTANCE': [np.min, np.max], 
         'TAXI_IN': np.mean})

In [57]:
summary_distanc_taxi_in.head()

              DISTANCE          TAXI_IN
                  amin  amax       mean
AIRLINE MONTH
AA      1          190  3784   9.176471
        2          175  2611  10.267606
        3          175  2504   9.800000
        4          192  2422  10.583333
        5          175  2585   8.350649

In [58]:
# Remember from the last class that we can do aggregations at multiple levels using Hierarchical index. 
summary_distanc_taxi_in.mean(level='AIRLINE')

           DISTANCE                 TAXI_IN
               amin         amax       mean
AIRLINE
AA       164.416667  2983.333333   9.190944
AS       144.416667  2675.666667   6.473706
B6       171.250000  2586.500000   5.994380
DL       120.833333  2989.666667   7.296186
EV        82.916667  1184.666667   7.680604
F9       508.833333  1829.500000  10.092238
HA        98.666667  2443.250000   7.181896
MQ       107.916667  1067.166667   8.579951
NK       305.583333  1844.750000   8.835690
OO        70.500000  1544.750000   6.729811
UA       171.500000  3261.833333   8.665904
US       171.000000  2568.000000   7.907480
VX       321.416667  2575.333333   7.742913
WN       170.833333  2271.666667   6.223307